of60/tutorials/rheoInterFoam/DieSwell/CarreauYasuda/0/alpha.water.org
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
       type            fixedValue;
       value           uniform 1;
    }
    
    outlet
    {
       type            zeroGradient;
    }
    
    wallIn
    {
       type            zeroGradient;
    }
    
    wallOut
    {
       type            fixedValue;
       value           uniform 0;
    }
    
    atmosphere
    {
       type            zeroGradient;
    }
    
    symmetry
    {
       type            symmetryPlane;
    }
}
 
